In [1]:
import pandas as pd

In [2]:
pd.set_option('display.unicode.east_asian_width', True)
data = [[2, 3, 4], [12, 34, 56], [32, 45, 23]]
index = [0, 1, 2]
columns = ['语文', '英语', '数学']

In [5]:
df = pd.DataFrame(data = data, index = index, columns = columns)
df

   语文  英语  数学
0     2     3     4
1    12    34    56
2    32    45    23

In [7]:
for col in df.columns : 
    series = df[col]
    print(series)

0     2
1    12
2    32
Name: 语文, dtype: int64
0     3
1    34
2    45
Name: 英语, dtype: int64
0     4
1    56
2    23
Name: 数学, dtype: int64

In [9]:
df = pd.DataFrame(data = data, columns = columns)
df

   语文  英语  数学
0     2     3     4
1    12    34    56
2    32    45    23

In [11]:
df = pd.DataFrame({
    '语文': [110, 105, 99], 
    '数学': [105, 88, 75], 
    '英语': [109, 120, 130], 
    '班级': '高一7班'
})
df

   语文  数学  英语     班级
0   110   105   109  高一7班
1   105    88   120  高一7班
2    99    75   130  高一7班

In [12]:
df.T

            0        1        2
语文      110      105       99
数学      105       88       75
英语      109      120      130
班级  高一7班  高一7班  高一7班

In [14]:
df.values

array([[110, 105, 109, '高一7班'],
       [105, 88, 120, '高一7班'],
       [99, 75, 130, '高一7班']], dtype=object)

In [15]:
df.dtypes

语文     int64
数学     int64
英语     int64
班级    object
dtype: object

In [19]:
df.shape

(3, 4)

In [20]:
df.info

<bound method DataFrame.info of    语文  数学  英语     班级
0   110   105   109  高一7班
1   105    88   120  高一7班
2    99    75   130  高一7班>

In [21]:
df.sum()

语文                      314
数学                      268
英语                      359
班级    高一7班高一7班高一7班
dtype: object

In [22]:
df.max()

语文        110
数学        105
英语        130
班级    高一7班
dtype: object

In [28]:
df['语文'].max()

110

In [29]:
df.describe()

             语文        数学        英语
count    3.000000    3.000000    3.000000
mean   104.666667   89.333333  119.666667
std      5.507571   15.044379   10.503968
min     99.000000   75.000000  109.000000
25%    102.000000   81.500000  114.500000
50%    105.000000   88.000000  120.000000
75%    107.500000   96.500000  125.000000
max    110.000000  105.000000  130.000000

In [30]:
df.std()

语文     5.507571
数学    15.044379
英语    10.503968
dtype: float64

In [31]:
df.isnull()

    语文   数学   英语   班级
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [33]:
df = pd.read_excel('1月xlsx.xlsx')
df.head()

  买家会员名  买家实际支付金额 收货人姓名            宝贝标题
0      mrhy1             41.86     周某某      零基础学Python
1      mrhy2             41.86     杨某某      零基础学Python
2      mrhy3             48.86     刘某某      零基础学Python
3      mrhy4             48.86     张某某      零基础学Python
4      mrhy5             48.86     赵某某  C#项目开发实战入门

In [36]:
df = pd.read_excel('1月xlsx.xlsx', sheet_name = 1)
df.head()

,买家会员名,买家支付宝账号,买家实际支付金额,订单状态,收货人姓名,收货地址,联系手机,订单创建时间,订单付款时间,宝贝标题,宝贝种类,物流单号,物流公司,订单备注,宝贝总数量,类别,图书编号
0,mmbooks101,********,41.86,交易成功,赵某人,贵州省 贵阳市 花溪区,1**********,2018-05-16 09:38:00,2018-05-16 09:41:00,Android项目开发实战入门,1,No:221307653963,申通快递,'null,1,全彩系列,B16
1,mmbooks102,********,41.86,交易成功,李某某,新疆维吾尔自治区 乌鲁木齐市 水磨沟区,1**********,2018-05-09 15:31:00,2018-05-09 15:31:00,Android项目开发实战入门,1,No:221307653740,申通快递,'null,1,全彩系列,B16
2,mmbooks103,********,48.86,交易成功,高某某,云南省 红河哈尼族彝族自治州 开远市,1**********,2018-05-25 15:21:00,2018-05-25 15:21:00,ASP.NET项目开发实战入门,1,No:221307653898,申通快递,'null,1,全彩系列,B17
3,mmbooks104,********,48.86,交易成功,高某某,云南省 红河哈尼族彝族自治州 开远市,1**********,2018-05-14 20:21:00,2018-05-14 20:22:00,ASP.NET项目开发实战入门,1,No:221307653892,申通快递,'null,1,全彩系列,B17
4,mmbooks105,********,48.86,交易成功,高某某,云南省 红河哈尼族彝族自治州 开远市,1**********,2018-05-22 18:47:00,2018-05-22 18:47:00,C#项目开发实战入门,1,No:221307653942,申通快递,'null,1,全彩系列,B18

In [42]:
df1 = pd.read_excel('1月xlsx.xlsx', index_col = 3)
df1.head()

                   买家会员名  买家实际支付金额 收货人姓名
宝贝标题
零基础学Python          mrhy1             41.86     周某某
零基础学Python          mrhy2             41.86     杨某某
零基础学Python          mrhy3             48.86     刘某某
零基础学Python          mrhy4             48.86     张某某
C#项目开发实战入门      mrhy5             48.86     赵某某

In [46]:

df1 = pd.read_excel('1月xlsx.xlsx', header = None)  # 列索引为数字
df1.head()

            0                 1           2               3
0  买家会员名  买家实际支付金额  收货人姓名        宝贝标题
1       mrhy1             41.86      周某某  零基础学Python
2       mrhy2             41.86      杨某某  零基础学Python
3       mrhy3             48.86      刘某某  零基础学Python
4       mrhy4             48.86      张某某  零基础学Python

In [55]:
df1[0].head()

0    买家会员名
1         mrhy1
2         mrhy2
3         mrhy3
4         mrhy4
Name: 0, dtype: object

In [56]:
# 等同于
df1 = pd.read_excel('1月xlsx.xlsx', usecols = [0])
df1.head()

  买家会员名
0      mrhy1
1      mrhy2
2      mrhy3
3      mrhy4
4      mrhy5

In [61]:
# 导入CSV
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
pd.set_option('display.unicode.east_asian_width', True)
df1 = pd.read_csv('1月csv.csv', encoding = 'gbk')
df1.head()

  买家会员名  买家实际支付金额 收货人姓名            宝贝标题    订单付款时间
0      mrhy1             41.86     周某某      零基础学Python   2018/5/16 9:41
1      mrhy2             41.86     杨某某      零基础学Python   2018/5/9 15:31
2      mrhy3             48.86     刘某某      零基础学Python  2018/5/25 15:21
3      mrhy4             48.86     张某某      零基础学Python  2018/5/25 15:21
4      mrhy5             48.86     赵某某  C#项目开发实战入门  2018/5/25 15:21